___

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" alt="CLRSWY"></p>

___

<h1><p style="text-align: center;">Pandas Lesson, Session - 5</p><h1>

# Aggregation & Groupby

The ``groupby`` method allows you to group rows of data together and call aggregate functions

### Basic aggregation methods:

* ``count()``
* ``mean()``
* ``median()``
* ``min()``
* ``max()``
* ``std()``
* ``var()``
* ``sum()``

In [7]:
import seaborn as sns
import pandas as pd
import numpy as np

In [8]:
df=sns.load_dataset('planets')
df.head(6)

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009
5  Radial Velocity       1         185.840   4.80     76.39  2008

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1035 non-null   object
 1   number          1035 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        808 non-null    float64
 5   year            1035 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

In [10]:
df.shape

(1035, 6)

In [11]:
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [12]:
df["mass"].mean()

2.6381605847953233

In [13]:
df.mass.count()

513

In [14]:
df.mass.min()

0.0036

In [15]:
df.mass.max()

25.0

In [16]:
df.mass.idxmin()

46

In [17]:
df.mass.idxmax()

321

In [18]:
df.mass.sum()

1353.37638

In [19]:
df.mass.std()

3.8186166509616046

In [20]:
df.mass.var()

14.58183312700122

In [21]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [22]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [23]:
df.isnull().sum()

method              0
number              0
orbital_period     43
mass              522
distance          227
year                0
dtype: int64

In [24]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

In [25]:
df.corr()

                  number  orbital_period      mass  distance      year
number          1.000000       -0.012570 -0.241429 -0.033638  0.147849
orbital_period -0.012570        1.000000  0.173725 -0.034365 -0.032333
mass           -0.241429        0.173725  1.000000  0.274082 -0.123787
distance       -0.033638       -0.034365  0.274082  1.000000  0.178922
year            0.147849       -0.032333 -0.123787  0.178922  1.000000

In [26]:
df[['mass','distance']].corr()

              mass  distance
mass      1.000000  0.274082
distance  0.274082  1.000000

 - # ``df.groupby()``

In [27]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [28]:
df['method'].value_counts()

Radial Velocity                  553
Transit                          397
Imaging                           38
Microlensing                      23
Eclipse Timing Variations          9
Pulsar Timing                      5
Transit Timing Variations          4
Orbital Brightness Modulation      3
Astrometry                         2
Pulsation Timing Variations        1
Name: method, dtype: int64

In [29]:
df.groupby('method')

In [30]:
df.groupby("method")[["orbital_period"]].mean()

                               orbital_period
method
Astrometry                         631.180000
Eclipse Timing Variations         4751.644444
Imaging                         118247.737500
Microlensing                      3153.571429
Orbital Brightness Modulation        0.709307
Pulsar Timing                     7343.021201
Pulsation Timing Variations       1170.000000
Radial Velocity                    823.354680
Transit                             21.102073
Transit Timing Variations           79.783500

In [31]:
df.groupby("method")[["orbital_period"]].describe()

                              orbital_period                                \
                                       count           mean            std
method
Astrometry                               2.0     631.180000     544.217663
Eclipse Timing Variations                9.0    4751.644444    2499.130945
Imaging                                 12.0  118247.737500  213978.177277
Microlensing                             7.0    3153.571429    1113.166333
Orbital Brightness Modulation            3.0       0.709307       0.725493
Pulsar Timing                            5.0    7343.021201   16313.265573
Pulsation Timing Variations              1.0    1170.000000            NaN
Radial Velocity                        553.0     823.354680    1454.926210
Transit                                397.0      21.102073      46.185893
Transit Timing Variations                3.0      79.783500      71.599884

                                                                       \
                                       min          25%           50%
method
Astrometry                      246.360000   438.770000    631.180000
Eclipse Timing Variations      1916.250000  2900.000000   4343.500000
Imaging                        4639.150000  8343.900000  27500.000000
Microlensing                   1825.000000  2375.000000   3300.000000
Orbital Brightness Modulation     0.240104     0.291496      0.342887
Pulsar Timing                     0.090706    25.262000     66.541900
Pulsation Timing Variations    1170.000000  1170.000000   1170.000000
Radial Velocity                   0.736540    38.021000    360.200000
Transit                           0.355000     3.160630      5.714932
Transit Timing Variations        22.339500    39.675250     57.011000


                                        75%            max
method
Astrometry                       823.590000    1016.000000
Eclipse Timing Variations       5767.000000   10220.000000
Imaging                        94250.000000  730000.000000
Microlensing                    3550.000000    5100.000000
Orbital Brightness Modulation      0.943908       1.544929
Pulsar Timing                     98.211400   36525.000000
Pulsation Timing Variations     1170.000000    1170.000000
Radial Velocity                  982.000000   17337.500000
Transit                           16.145700     331.600590
Transit Timing Variations        108.505500     160.000000

In [38]:
df.method.value_counts()

Radial Velocity                  553
Transit                          397
Imaging                           38
Microlensing                      23
Eclipse Timing Variations          9
Pulsar Timing                      5
Transit Timing Variations          4
Orbital Brightness Modulation      3
Astrometry                         2
Pulsation Timing Variations        1
Name: method, dtype: int64

In [39]:
df.columns

Index(['method', 'number', 'orbital_period', 'mass', 'distance', 'year'], dtype='object')

In [33]:
df.groupby('method')[['distance']].sum()

                                distance
method
Astrometry                         35.75
Eclipse Timing Variations        1261.44
Imaging                          2166.91
Microlensing                    41440.00
Orbital Brightness Modulation    2360.00
Pulsar Timing                    1200.00
Pulsation Timing Variations         0.00
Radial Velocity                 27348.11
Transit                        134242.77
Transit Timing Variations        3313.00

In [34]:
df.year.value_counts()

2011    185
2012    140
2013    118
2010    102
2009     98
2008     74
2007     53
2014     52
2005     39
2002     32
2006     31
2004     26
2003     25
2000     16
1999     15
2001     12
1996      6
1998      5
1992      2
1997      1
1995      1
1994      1
1989      1
Name: year, dtype: int64

In [35]:
df.year.unique()

array([2006, 2008, 2011, 2007, 2009, 2002, 1996, 2010, 2001, 1995, 2004,
       2012, 2013, 2005, 2000, 2003, 1997, 1999, 2014, 1998, 1989, 1992,
       1994], dtype=int64)

In [37]:
df.groupby('year')['mass'].count()

year
1989     1
1992     0
1994     0
1995     1
1996     4
1997     1
1998     5
1999    14
2000    14
2001    11
2002    31
2003    22
2004    15
2005    34
2006    20
2007    32
2008    43
2009    74
2010    41
2011    91
2012    24
2013    30
2014     5
Name: mass, dtype: int64

In [40]:
data = {'Company':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
       'Person':['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
       'Sales':[200, 120, 340, 124, 243, 350]}

In [41]:
df1 = pd.DataFrame(data)

In [42]:
df1

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

**Now you can use the ``.groupby()`` method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:**

In [43]:
df1.groupby('Company')

You can save this object as a new variable:

In [44]:
by_comp=df1.groupby('Company')

And then call aggregate methods off the object:

In [45]:
by_comp.median()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [46]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

More examples of aggregate methods:

In [47]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [48]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [49]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [50]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [51]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [52]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [53]:
by_comp.describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

 - # ``DataFrame`` Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show **Common Operations** here in this lecture:

- Quick review and refresh

In [54]:
df2 = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df2.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [55]:
app = df2.loc[:,['col1']]
app

   col1
0     1
1     2
2     3
3     4

In [58]:
app2= df2.iloc[:,[0]]
app2

   col1
0     1
1     2
2     3
3     4

In [59]:
df2['col2'].unique()

array([444, 555, 666], dtype=int64)

In [60]:
df2

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [61]:
df2.col2.nunique()

3

In [62]:
df2.col3.value_counts()

abc    1
xyz    1
def    1
ghi    1
Name: col3, dtype: int64

### Selecting Data

In [63]:
#Select from DataFrame using criteria from multiple columns
newdf=df2[(df2.col1>2) & (df2.col2<666)]

In [64]:
newdf

   col1  col2 col3
3     4   444  xyz

In [66]:
df2.col2.sum()

2109

**Permanently Removing a Column**

In [67]:
df2

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [69]:
#df2.drop('col1',axis=1,inplace=True)
del df2['col1']

In [70]:
df2

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [71]:
df2.insert(loc=0,column='col1',value=app2)
df2

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

**Get column and index names:**

In [72]:
df2.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [73]:
df2.index

RangeIndex(start=0, stop=4, step=1)

**Sorting and Ordering a DataFrame:**

In [74]:
df2

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [77]:
df2.sort_values(by=['col2'])
# inplace=False by default

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

**Find Null Values or Check for Null Values**

In [79]:
#df2.isnull()
df2.isna()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [83]:
df2.loc[2,'col1']=np.nan

In [84]:
df2

   col1  col2 col3
0   1.0   444  abc
1   2.0   555  def
2   NaN   666  ghi
3   4.0   444  xyz

In [85]:
# Drop rows with NaN Values
df2.dropna()

   col1  col2 col3
0   1.0   444  abc
1   2.0   555  def
3   4.0   444  xyz

**Filling in NaN values with something else:**

In [86]:
df3 = pd.DataFrame({'col1':[1, 2, 3, np.nan],
                   'col2':[np.nan, 555, 666, 444],
                   'col3':['abc', 'def', 'ghi', 'xyz']})
df3.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [87]:
df3.col1.fillna(df3.col1.mean())

0    1.0
1    2.0
2    3.0
3    2.0
Name: col1, dtype: float64

In [88]:
df3.fillna('FILL')

   col1  col2 col3
0     1  FILL  abc
1     2   555  def
2     3   666  ghi
3  FILL   444  xyz

In [90]:
df3

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [91]:
df3.fillna(method='bfill')

   col1   col2 col3
0   1.0  555.0  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [92]:
df3.dropna()

   col1   col2 col3
1   2.0  555.0  def
2   3.0  666.0  ghi

**Map / Replace**

In [93]:
data = {'Company':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
       'Person':['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
       'Sales':[200, 120, 340, 124, 243, 350]}

In [94]:
df4=pd.DataFrame(data)

In [95]:
df4

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [96]:
my_map={'GOOG':'GOO','MSFT':'MIC','FB':'FACE'}

In [97]:
df_m=df4.copy()

In [98]:
df_m.Company=df_m.Company.map(my_map)

In [100]:
df_m

  Company   Person  Sales
0     GOO      Sam    200
1     GOO  Charlie    120
2     MIC      Amy    340
3     MIC  Vanessa    124
4    FACE     Carl    243
5    FACE    Sarah    350

In [101]:
df_m['Sales']=df_m.Sales.map(lambda x: x*1000)
df_m

  Company   Person   Sales
0     GOO      Sam  200000
1     GOO  Charlie  120000
2     MIC      Amy  340000
3     MIC  Vanessa  124000
4    FACE     Carl  243000
5    FACE    Sarah  350000

In [102]:
df_m['Company'].replace(to_replace='GOO',value='Google')

0    Google
1    Google
2       MIC
3       MIC
4      FACE
5      FACE
Name: Company, dtype: object

In [103]:
df_m['Sales']=df_m['Sales'].astype(str)
df_m

  Company   Person   Sales
0     GOO      Sam  200000
1     GOO  Charlie  120000
2     MIC      Amy  340000
3     MIC  Vanessa  124000
4    FACE     Carl  243000
5    FACE    Sarah  350000

In [104]:
df_m['Sales']=df_m.Sales.map(lambda x : x[:-3])

In [105]:
df_m

  Company   Person Sales
0     GOO      Sam   200
1     GOO  Charlie   120
2     MIC      Amy   340
3     MIC  Vanessa   124
4    FACE     Carl   243
5    FACE    Sarah   350

In [106]:
df_m.Sales=df_m.Sales+'K'
df_m

  Company   Person Sales
0     GOO      Sam  200K
1     GOO  Charlie  120K
2     MIC      Amy  340K
3     MIC  Vanessa  124K
4    FACE     Carl  243K
5    FACE    Sarah  350K

**Duplicate / Between**

In [107]:
df4.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [108]:
dup_df = pd.DataFrame([5,5,6,7,8,8,7,12,25,55,25],['a','b','c','d','e','f','g','h','i','j','k'])
dup_df

    0
a   5
b   5
c   6
d   7
e   8
f   8
g   7
h  12
i  25
j  55
k  25

In [109]:
dup_df.duplicated()

a    False
b     True
c    False
d    False
e    False
f     True
g     True
h    False
i    False
j    False
k     True
dtype: bool

In [110]:
dup_df.drop_duplicates()

    0
a   5
c   6
d   7
e   8
h  12
i  25
j  55

In [111]:
dup_df[0].between(8,24, inclusive=False)

a    False
b    False
c    False
d    False
e    False
f    False
g    False
h     True
i    False
j    False
k    False
Name: 0, dtype: bool

In [112]:
df4

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [113]:
df4.nlargest(2,'Sales')

  Company Person  Sales
5      FB  Sarah    350
2    MSFT    Amy    340

In [114]:
df4.nsmallest(3,'Sales')

  Company   Person  Sales
1    GOOG  Charlie    120
3    MSFT  Vanessa    124
0    GOOG      Sam    200

In [117]:
df5=df4.append(df4.loc[3],ignore_index=True)

In [118]:
df5

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350
6    MSFT  Vanessa    124

In [120]:
df5.nsmallest(3, 'Sales', keep='first')

  Company   Person  Sales
1    GOOG  Charlie    120
3    MSFT  Vanessa    124
6    MSFT  Vanessa    124

- ### `.aggregate()`
- ### `.filter()`
- ### `.transform()`
- ### `.apply()`
- ### `.pivot_table()`

In [121]:
df6 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,23,33,22,11,99],
                   'var2': [100,253,333,262,111,969]})
df6

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

### ``.aggregate()``

In [122]:
df6.groupby('groups').mean()

        var1  var2
groups
A         16   181
B         17   182
C         66   651

In [123]:
df6.groupby('groups').aggregate([np.min,np.median,np.max])

       var1             var2
       amin median amax amin median amax
groups
A        10     16   22  100    181  262
B        11     17   23  111    182  253
C        33     66   99  333    651  969

In [125]:
df6.groupby('groups').agg([min,'median',max])

       var1            var2
        min median max  min median  max
groups
A        10     16  22  100    181  262
B        11     17  23  111    182  253
C        33     66  99  333    651  969

In [127]:
df6.groupby('groups').agg({'var1':('min','max') , 'var2':'median'})

       var1       var2
        min max median
groups
A        10  22    181
B        11  23    182
C        33  99    651

### ``.filter()``

In [128]:
df7 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,23,33,22,11,99],
                   'var2': [100,253,333,262,111,969]})
df7

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [129]:
df7.groups.unique()

array(['A', 'B', 'C'], dtype=object)

In [130]:
df7.groupby("groups").std()

             var1        var2
groups
A        8.485281  114.551299
B        8.485281  100.409163
C       46.669048  449.719913

In [131]:
def filter_func(x):
    return x["var1"].mean() > 19

In [134]:
df7.groupby("groups").mean()

        var1  var2
groups
A         16   181
B         17   182
C         66   651

In [132]:
# returns the rows that meet the condition, as a DataFrame
df7.groupby('groups').filter(filter_func)

  groups  var1  var2
2      C    33   333
5      C    99   969

In [135]:
df7.groupby("groups").sum()

        var1  var2
groups
A         32   362
B         34   364
C        132  1302

In [136]:
df7.groupby('groups').filter(lambda x : x['var2'].sum()<444)

  groups  var1  var2
0      A    10   100
1      B    23   253
3      A    22   262
4      B    11   111

### ``.transform()``

In [137]:
df8 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,23,33,22,11,99],
                   'var2': [100,253,333,262,111,969]})
df8

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [138]:
df8["var1"]*9

0     90
1    207
2    297
3    198
4     99
5    891
Name: var1, dtype: int64

In [139]:
df_a = df8.iloc[:,1:3]

In [140]:
df_a

   var1  var2
0    10   100
1    23   253
2    33   333
3    22   262
4    11   111
5    99   969

In [141]:
# returns A DataFrame that must have the same length as self. Standardization(mean 0 std 1) Normalization (0-1)
df_a.transform(lambda x : (x-x.mean())/x.std())

       var1      var2
0 -0.687871 -0.738461
1 -0.299074 -0.263736
2  0.000000 -0.015514
3 -0.328982 -0.235811
4 -0.657963 -0.704331
5  1.973890  1.957853

In [142]:
df_a.iloc[0,0]

10

In [143]:
(df_a.iloc[0,0] - df_a.var1.mean()) / df_a.var1.std()

-0.6878708952377661

In [144]:
df_a

   var1  var2
0    10   100
1    23   253
2    33   333
3    22   262
4    11   111
5    99   969

In [145]:
np.log(df_a.var1)

0    2.302585
1    3.135494
2    3.496508
3    3.091042
4    2.397895
5    4.595120
Name: var1, dtype: float64

### ``.apply()``

In [146]:
df9 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,23,33,22,11,99],
                   'var2': [100,253,333,262,111,969]})
df9

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [147]:
df9.apply(np.sum)

groups    ABCABC
var1         198
var2        2028
dtype: object

In [148]:
df9.var1.sum()

198

In [149]:
# sum() functions works with putting + sign between each element of an iterable object

df9.groups.sum()

'ABCABC'

In [668]:
# It gives an error due to the non-numeric column : "groups"

# df4.apply(np.median)

In [150]:
df_numeric = df9.iloc[:,1:3]

In [151]:
df_numeric

   var1  var2
0    10   100
1    23   253
2    33   333
3    22   262
4    11   111
5    99   969

In [152]:
df_numeric.apply(np.median)

var1     22.5
var2    257.5
dtype: float64

In [153]:
df_numeric.apply(np.mean, axis=1)

0     55.0
1    138.0
2    183.0
3    142.0
4     61.0
5    534.0
dtype: float64

In [154]:
df9.groupby('groups').apply(np.mean)

        var1   var2
groups
A       16.0  181.0
B       17.0  182.0
C       66.0  651.0

In [155]:
df9.groupby("groups").mean()

        var1  var2
groups
A         16   181
B         17   182
C         66   651

In [156]:
# Applying Functions using df6

df10 = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

df10

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [157]:
def squared(x):
    return x**2

In [158]:
df10['col1'].apply(squared)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [160]:
df10['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

### `df.transform() vs df.apply()`

In [161]:
df10

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [162]:
df10["col3"].transform(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [163]:
#returns the length of each variable (columns) separately
df10.apply(len)

col1    4
col2    4
col3    4
dtype: int64

In [164]:
df1 = pd.DataFrame([["a", 9, 25]] * 4, columns=["grp", 'P', 'Q'])
df2 = pd.DataFrame([["b", 9, 25]] * 3, columns=["grp", 'P', 'Q'])
df3 = pd.concat([df1, df2], ignore_index=True)
df3

  grp  P   Q
0   a  9  25
1   a  9  25
2   a  9  25
3   a  9  25
4   b  9  25
5   b  9  25
6   b  9  25

In [165]:
df3.apply(lambda x : x+x)

  grp   P   Q
0  aa  18  50
1  aa  18  50
2  aa  18  50
3  aa  18  50
4  bb  18  50
5  bb  18  50
6  bb  18  50

In [166]:
df3.transform(lambda y:y+y)

  grp   P   Q
0  aa  18  50
1  aa  18  50
2  aa  18  50
3  aa  18  50
4  bb  18  50
5  bb  18  50
6  bb  18  50

In [167]:
# returns a DataFrame that does not have the same length as itself
df3.groupby("grp").apply(sum)

      grp   P    Q
grp
a    aaaa  36  100
b     bbb  27   75

In [169]:
df3

  grp  P   Q
0   a  9  25
1   a  9  25
2   a  9  25
3   a  9  25
4   b  9  25
5   b  9  25
6   b  9  25

In [168]:
df3.groupby("grp").transform(sum)

    P    Q
0  36  100
1  36  100
2  36  100
3  36  100
4  27   75
5  27   75
6  27   75

In [170]:
df3.groupby("grp").sum()

      P    Q
grp
a    36  100
b    27   75

In [695]:
df3

  grp  P   Q
0   a  9  25
1   a  9  25
2   a  9  25
3   a  9  25
4   b  9  25
5   b  9  25
6   b  9  25

In [171]:
def squared(x,y):
    return (x**2,y**2)

In [172]:
df3['R'] = df3[['P','Q']].apply(lambda df3: squared(df3['P'],df3['Q']),axis=1)

In [173]:
df3

  grp  P   Q          R
0   a  9  25  (81, 625)
1   a  9  25  (81, 625)
2   a  9  25  (81, 625)
3   a  9  25  (81, 625)
4   b  9  25  (81, 625)
5   b  9  25  (81, 625)
6   b  9  25  (81, 625)

### Pivot Tables

In [174]:
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [175]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [176]:
titanic.groupby(["sex","class"])[["survived"]].mean()

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [177]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean")

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [178]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

### Using pivot table

- Create a spreadsheet-style pivot table as a ``DataFrame``.

In [179]:
titanic.pivot_table('survived',index='sex',columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [180]:
titanic.pivot_table("age", index = "sex", columns = "class")

class       First     Second      Third
sex
female  34.611765  28.722973  21.750000
male    41.281386  30.740707  26.507589

In [181]:
titanic.pivot_table("age", index = "class", columns = "sex")

sex        female       male
class
First   34.611765  41.281386
Second  28.722973  30.740707
Third   21.750000  26.507589

In [182]:
titanic.age.head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

In [183]:
age = pd.cut(titanic["age"], [0, 18, 90])
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [184]:
titanic.pivot_table("survived", ["sex", age], "class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

In [185]:
data = {'A':['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
       'B':['one', 'one', 'two', 'two', 'one', 'one'],
       'C':['x', 'y', 'x', 'y', 'x', 'y'],
       'D':[1, 3, 2, 5, 4, 1]}

df5 = pd.DataFrame(data)

df5

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [186]:
df5.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# The End of the Session - 5